{
    "slug":  "disney-streaming-profitability-milestone",
    "category":  "Business",
    "title":  "Disney+ Reaches Profitability Milestone with 180 Million Subscribers",
    "introText":  "Disney+ has achieved profitability for the first time, reaching 180 million global subscribers. The milestone validates Disney\u0027s streaming strategy and signals a new era for the entertainment giant\u0027s direct-to-consumer business.",
    "readingTime":  "7 Min Read",
    "author":  {
                   "image":  "/images/authors/author-8.webp",
                   "name":  "Michael Anderson",
                   "role":  "Foreign Correspondent"
               },
    "lastUpdated":  "December 13, 2025",
    "content":  [
                    {
                        "type":  "image",
                        "content":  "Disney+ achieves profitability milestone",
                        "imageUrl":  "/images/news/movie-theater.webp",
                        "imageAlt":  "Entertainment streaming"
                    },
                    {
                        "type":  "heading",
                        "content":  "Profitability Achievement",
                        "level":  2
                    },
                    {
                        "type":  "paragraph",
                        "content":  "Disney\u0027s streaming business has turned profitable, generating $200 million in operating income during the quarter. The achievement comes five years after Disney+ launched and marks a crucial turning point for the company."
                    },
                    {
                        "type":  "paragraph",
                        "content":  "CEO credited price increases, reduced content spending, and the introduction of advertising tiers for the improved economics."
                    },
                    {
                        "type":  "heading",
                        "content":  "Subscriber Growth",
                        "level":  2
                    },
                    {
                        "type":  "paragraph",
                        "content":  "Disney+ now has 180 million subscribers globally, with the combined Disney+, Hulu, and ESPN+ bundle reaching 250 million accounts. International expansion, particularly in Asia, drove recent growth."
                    },
                    {
                        "type":  "paragraph",
                        "content":  "Average revenue per user has increased 15% following price increases and ad-tier adoption."
                    },
                    {
                        "type":  "heading",
                        "content":  "Content Strategy",
                        "level":  2
                    },
                    {
                        "type":  "paragraph",
                        "content":  "Disney is focusing on quality over quantity, reducing the number of original series while increasing investment in tentpole releases. Star Wars, Marvel, and Pixar content continue to drive subscriber engagement."
                    }
                ],
    "bookmarked":  false,
    "summary": "Disney+ reaches profitability with 180 million subscribers, marking a significant milestone in its streaming strategy."

}
