{
    "slug":  "investigative-report-climate-data",
    "category":  "Featured",
    "title":  "Investigation: How Climate Data Is Being Manipulated by Industry",
    "introText":  "A six-month investigation reveals how fossil fuel companies have funded research designed to cast doubt on climate science. Internal documents show coordinated campaigns to delay action on global warming.",
    "readingTime":  "18 Min Read",
    "author":  {
                   "image":  "/images/authors/author-1.webp",
                   "name":  "Sarah Mitchell",
                   "role":  "Chief Political Correspondent"
               },
    "lastUpdated":  "December 15, 2025",
    "content":  [
                    {
                        "type":  "image",
                        "content":  "Climate disinformation investigation",
                        "imageUrl":  "/images/news/climate-data-manipulation-industry-investigation.webp",
                        "imageAlt":  "Climate data"
                    },
                    {
                        "type":  "heading",
                        "content":  "What We Found",
                        "level":  2
                    },
                    {
                        "type":  "paragraph",
                        "content":  "Internal industry documents obtained by our investigation show that major oil companies funded think tanks and researchers specifically to create the appearance of scientific uncertainty about climate change."
                    },
                    {
                        "type":  "heading",
                        "content":  "The Strategy",
                        "level":  2
                    },
                    {
                        "type":  "paragraph",
                        "content":  "The playbook was borrowed from tobacco: fund contrarian research, amplify minority scientific views, and lobby against regulation. The goal was not to win the scientific debate but to delay policy action."
                    },
                    {
                        "type":  "heading",
                        "content":  "Accountability",
                        "level":  2
                    },
                    {
                        "type":  "paragraph",
                        "content":  "State attorneys general are now investigating whether these campaigns constitute fraud. Climate litigation against fossil fuel companies is accelerating based on evidence of deliberate deception."
                    }
                ],
    "bookmarked":  false,
    "summary": "An investigation reveals how fossil fuel companies manipulated climate data and funded research to delay action on global warming, with legal consequences underway."

}
