{
    "slug":  "mental-health-support-schools",
    "category":  "Education",
    "title":  "Schools Nationwide Expand Mental Health Services After Funding Boost",
    "introText":  "Schools across America are significantly expanding mental health services following a $5 billion federal investment. Counselor-to-student ratios are improving for the first time in decades as the youth mental health crisis receives overdue attention.",
    "readingTime":  "7 Min Read",
    "author":  {
                   "image":  "/images/authors/author-1.webp",
                   "name":  "Sarah Mitchell",
                   "role":  "Chief Political Correspondent"
               },
    "lastUpdated":  "December 16, 2025",
    "content":  [
                    {
                        "type":  "image",
                        "content":  "School mental health expansion",
                        "imageUrl":  "/images/news/mental-health.webp",
                        "imageAlt":  "Mental health support"
                    },
                    {
                        "type":  "heading",
                        "content":  "Service Expansion",
                        "level":  2
                    },
                    {
                        "type":  "paragraph",
                        "content":  "Schools have hired 50,000 additional counselors, psychologists, and social workers since the funding was allocated. The national counselor-to-student ratio has improved from 1:400 to 1:300."
                    },
                    {
                        "type":  "heading",
                        "content":  "Crisis Response",
                        "level":  2
                    },
                    {
                        "type":  "paragraph",
                        "content":  "Youth mental health indicators have been alarming, with teen depression and anxiety at record levels. Schools are implementing universal screening, crisis intervention protocols, and connections to community resources."
                    },
                    {
                        "type":  "heading",
                        "content":  "Early Results",
                        "level":  2
                    },
                    {
                        "type":  "paragraph",
                        "content":  "Early data shows reduced disciplinary incidents and improved attendance in schools with expanded services. Students report greater willingness to seek help when resources are readily available."
                    }
                ],
    "bookmarked":  false,
    "summary": "After a $5B federal investment, schools expand mental health services and improve counselor-to-student ratios nationwide."

}
