{
    "slug":  "plastic-eating-enzyme-breakthrough",
    "category":  "Environment",
    "title":  "Scientists Develop Super-Enzyme That Breaks Down Plastic in 24 Hours",
    "introText":  "Researchers have engineered a super-enzyme capable of breaking down common plastics within 24 hours, a process that normally takes centuries. The breakthrough could revolutionize plastic recycling and help address the global pollution crisis.",
    "readingTime":  "7 Min Read",
    "author":  {
                   "image":  "/images/authors/author-5.webp",
                   "name":  "Aisha Patel",
                   "role":  "Health \u0026 Science Correspondent"
               },
    "lastUpdated":  "December 14, 2025",
    "content":  [
                    {
                        "type":  "image",
                        "content":  "New enzyme offers solution to plastic pollution crisis",
                        "imageUrl":  "/images/news/plastic-waste.webp",
                        "imageAlt":  "Plastic waste pollution"
                    },
                    {
                        "type":  "heading",
                        "content":  "Revolutionary Discovery",
                        "level":  2
                    },
                    {
                        "type":  "paragraph",
                        "content":  "Scientists at the University of Texas have created a modified enzyme called FAST-PETase that degrades PET plastic – used in bottles and packaging – in just 24 hours. The process produces raw materials that can be used to make new plastic of the same quality."
                    },
                    {
                        "type":  "paragraph",
                        "content":  "The enzyme was developed using machine learning to optimize a naturally occurring protein found in bacteria. The AI-designed modifications increased breakdown speed by 1,000 times compared to natural versions."
                    },
                    {
                        "type":  "heading",
                        "content":  "How It Works",
                        "level":  2
                    },
                    {
                        "type":  "paragraph",
                        "content":  "The enzyme breaks plastic polymers into their original monomers – the building blocks from which plastic is made. These monomers can then be reformed into new plastic without degradation in quality, unlike mechanical recycling."
                    },
                    {
                        "type":  "paragraph",
                        "content":  "The process works at room temperature and normal pressure, requiring minimal energy input. This makes it potentially cost-competitive with producing new plastic from petroleum."
                    },
                    {
                        "type":  "heading",
                        "content":  "Commercial Potential",
                        "level":  2
                    },
                    {
                        "type":  "paragraph",
                        "content":  "Several major consumer goods companies have expressed interest in licensing the technology. Coca-Cola and Unilever are in discussions to pilot enzyme recycling at their facilities."
                    },
                    {
                        "type":  "paragraph",
                        "content":  "Scaling production of the enzyme remains a challenge, but researchers estimate commercial viability within 3-5 years. Patents have been filed and a startup is being formed to accelerate development."
                    },
                    {
                        "type":  "heading",
                        "content":  "Environmental Impact",
                        "level":  2
                    },
                    {
                        "type":  "paragraph",
                        "content":  "If widely deployed, enzymatic recycling could process the billions of tons of plastic waste accumulating in landfills and oceans. The technology works on plastics too degraded for traditional recycling methods."
                    }
                ],
    "bookmarked":  false,
    "summary": "Scientists have developed a super-enzyme that breaks down plastic in just 24 hours, offering a potential breakthrough in recycling."

}
